#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

data.aws_iam_role.name: Reading...
module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay: Refreshing state... [id=woef9vpe8i]
aws_secretsmanager_secret.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:590184128247:secret:lambda-auth-credentials-ueI9o0]
module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool: Refreshing state... [id=us-east-1_29eixIjTm]
module.apiGateway.aws_api_gateway_resource.auth: Refreshing state... [id=vzapwk]
module.apiGateway.aws_api_gateway_resource.cadastro: Refreshing state... [id=zzva4m]
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
module.lambda.aws_lambda_function.tech_lanches_lambda_cadastro: Refreshing state... [id=tech-lanches-lambda-cadastro]
module.lambda.aws_lambda_function.tech_lanches_lambda_auth: Refreshing state... [id=tech-lanches-lambda-auth]
module.apiGateway.aws_api_gateway_method.cadastro: Refreshing state... [id=agm-woef9vpe8i-zzva4m-POST]
module.apiGateway.aws_api_gateway_method.auth: Refreshing state... [id=agm-woef9vpe8i-vzapwk-POST]
module.apiGateway.aws_lambda_permission.apigateway_lambda_cadastro: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apiGateway.aws_api_gateway_integration.lambda_cadastro: Refreshing state... [id=agi-woef9vpe8i-zzva4m-POST]
module.apiGateway.aws_lambda_permission.apigateway_lambda_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apiGateway.aws_api_gateway_integration.lambda_auth: Refreshing state... [id=agi-woef9vpe8i-vzapwk-POST]
module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client: Refreshing state... [id=2g7o7m3mommfu2m95mjloot77e]
module.apiGateway.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=c3sx3q]
aws_secretsmanager_secret_version.lambda_auth_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:590184128247:secret:lambda-auth-credentials-ueI9o0|terraform-20240309170922839800000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.apiGateway.aws_api_gateway_method.auth has been deleted
  - resource "aws_api_gateway_method" "auth" {
      - http_method          = "POST" -> null
        id                   = "agm-woef9vpe8i-vzapwk-POST"
      - resource_id          = "vzapwk" -> null
        # (6 unchanged attributes hidden)
    }

  # module.apiGateway.aws_api_gateway_method.cadastro has been deleted
  - resource "aws_api_gateway_method" "cadastro" {
      - http_method          = "POST" -> null
        id                   = "agm-woef9vpe8i-zzva4m-POST"
      - resource_id          = "zzva4m" -> null
        # (6 unchanged attributes hidden)
    }

  # module.apiGateway.aws_api_gateway_resource.auth has been deleted
  - resource "aws_api_gateway_resource" "auth" {
      - id          = "vzapwk" -> null
        # (4 unchanged attributes hidden)
    }

  # module.apiGateway.aws_api_gateway_resource.cadastro has been deleted
  - resource "aws_api_gateway_resource" "cadastro" {
      - id          = "zzva4m" -> null
        # (4 unchanged attributes hidden)
    }

  # module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay has been deleted
  - resource "aws_api_gateway_rest_api" "tech_lanches_api_gateweay" {
      - execution_arn                = "arn:aws:execute-api:us-east-1:590184128247:woef9vpe8i" -> null
      - id                           = "woef9vpe8i" -> null
        name                         = "tech-lanches-api-gateway"
      - root_resource_id             = "seybnb07wg" -> null
        tags                         = {
            "Name" = "techlanches_apigateway"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda_auth has been deleted
  - resource "aws_lambda_function" "tech_lanches_lambda_auth" {
      - function_name                  = "tech-lanches-lambda-auth" -> null
        id                             = "tech-lanches-lambda-auth"
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:590184128247:function:tech-lanches-lambda-auth/invocations" -> null
        tags                           = {
            "Name" = "tech-lanches-lambda"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda_cadastro has been deleted
  - resource "aws_lambda_function" "tech_lanches_lambda_cadastro" {
      - function_name                  = "tech-lanches-lambda-cadastro" -> null
        id                             = "tech-lanches-lambda-cadastro"
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:590184128247:function:tech-lanches-lambda-cadastro/invocations" -> null
        tags                           = {
            "Name" = "tech-lanches-lambda"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.apiGateway.aws_api_gateway_deployment.gateway_deployment must be replaced
-/+ resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date  = "2024-03-11T23:37:55Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:590184128247:woef9vpe8i/Development" -> (known after apply)
      ~ id            = "c3sx3q" -> (known after apply)
      ~ invoke_url    = "https://woef9vpe8i.execute-api.us-east-1.amazonaws.com/Development" -> (known after apply)
      ~ rest_api_id   = "woef9vpe8i" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.apiGateway.aws_api_gateway_integration.lambda_auth will be created
  + resource "aws_api_gateway_integration" "lambda_auth" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_integration.lambda_cadastro will be created
  + resource "aws_api_gateway_integration" "lambda_cadastro" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_method.auth will be created
  + resource "aws_api_gateway_method" "auth" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_method.cadastro will be created
  + resource "aws_api_gateway_method" "cadastro" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_resource.auth will be created
  + resource "aws_api_gateway_resource" "auth" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "auth"
      + rest_api_id = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_resource.cadastro will be created
  + resource "aws_api_gateway_resource" "cadastro" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "cadastro"
      + rest_api_id = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay will be created
  + resource "aws_api_gateway_rest_api" "tech_lanches_api_gateweay" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "tech-lanches-api-gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "Name" = "techlanches_apigateway"
        }
      + tags_all                     = {
          + "Name" = "techlanches_apigateway"
        }
    }

  # module.apiGateway.aws_lambda_permission.apigateway_lambda_auth will be created
  + resource "aws_lambda_permission" "apigateway_lambda_auth" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tech-lanches-lambda-auth"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.apiGateway.aws_lambda_permission.apigateway_lambda_cadastro will be created
  + resource "aws_lambda_permission" "apigateway_lambda_cadastro" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tech-lanches-lambda-cadastro"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda_auth will be created
  + resource "aws_lambda_function" "tech_lanches_lambda_auth" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../Serverless/auth_lambda.zip"
      + function_name                  = "tech-lanches-lambda-auth"
      + handler                        = "TechLanchesLambda::TechLanchesLambda.Functions_LambdaAuth_Generated::LambdaAuth"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::590184128247:role/LabRole"
      + runtime                        = "dotnet8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "tech-lanches-lambda"
        }
      + tags_all                       = {
          + "Name" = "tech-lanches-lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda_cadastro will be created
  + resource "aws_lambda_function" "tech_lanches_lambda_cadastro" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../Serverless/auth_lambda.zip"
      + function_name                  = "tech-lanches-lambda-cadastro"
      + handler                        = "TechLanchesLambda::TechLanchesLambda.Functions_LambdaCadastro_Generated::LambdaCadastro"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::590184128247:role/LabRole"
      + runtime                        = "dotnet8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "tech-lanches-lambda"
        }
      + tags_all                       = {
          + "Name" = "tech-lanches-lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)
    }

Plan: 12 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @nsosoares, Action: `pull_request`*